# -*- fill-column: 69; org-confirm-babel-evaluate: nil -*-
#+STARTUP: align entitiespretty hidestars inlineimages latexpreview noindent showall
#
#+TITLE: IP-TFS: Aggregation and Fragmentation Mode for ESP and its Use for IP Traffic Flow Security
#+AUTHOR: Christian Hopps
#+EMAIL: chopps@chopps.org
#+AFFILIATION: LabN Consulting, L.L.C.
#
#+RFC_NAME: draft-ietf-ipsecme-iptfs
#+RFC_SHORT_TITLE: IP Traffic Flow Security
#+RFC_VERSION: 13
#+RFC_XML_VERSION: 2
#+RFC_ASCII_TABLE: t
#
# Do: title, table-of-contents ::fixed-width-sections |tables
# Do: ^:sup/sub with curly -:special-strings *:emphasis
# Don't: prop:no-prop-drawers \n:preserve-linebreaks ':use-smart-quotes
#+OPTIONS: prop:nil title:t toc:t \n:nil ::t |:t ^:{} -:t *:t ':nil


#+begin_abstract
This document describes a mechanism for aggregation and
fragmentation of IP packets when they are being encapsulated in ESP
payload. This new payload type can be used for various purposes such
as decreasing encapsulation overhead for small IP packets; however,
the focus in this document is to enhance IPsec traffic flow security
(IP-TFS) by adding Traffic Flow Confidentiality (TFC) to encrypted IP
encapsulated traffic. TFC is provided by obscuring the size and
frequency of IP traffic using a fixed-sized, constant-send-rate IPsec
tunnel. The solution allows for congestion control as well as
non-constant send-rate usage.
#+end_abstract

*** IP-TFS Overhead

For comparison the overhead of AGGFRAG payload is 58 octets per outer packet.
Therefore the octet overhead per inner packet is 58 divided by the
number of outer packets required (fractional allowed). The overhead
as a percentage of inner packet size is a constant based on the Outer
MTU size.

#+begin_example
   OH = 58 / Outer Payload Size / Inner Packet Size
   OH % of Inner Packet Size = 100 * OH / Inner Packet Size
   OH % of Inner Packet Size = 5800 / Outer Payload Size
#+end_example

#+BEGIN_CENTER
#+CAPTION: IP-TFS Overhead as Percentage of Inner Packet Size
#+TBLNAME: tfsohpct
|  Type | IP-TFS | IP-TFS | IP-TFS |
|   MTU |    576 |   1500 |   9000 |
| PSize |    518 |   1442 |   8942 |
|-------+--------+--------+--------|
|    40 | 11.20% |  4.02% |  0.65% |
|   576 | 11.20% |  4.02% |  0.65% |
|  1500 | 11.20% |  4.02% |  0.65% |
|  9000 | 11.20% |  4.02% |  0.65% |
#+TBLFM: @3$2..@3$>=@2-$tfso::@4$2..@>$>=5800/@3;%.2f%%
#+END_CENTER

** Overhead Comparison

The following tables collect the overhead values for some common L3
MTU sizes in order to compare them. The first table is the number of
octets of overhead for a given L3 MTU sized packet. The second table
is the percentage of overhead in the same MTU sized packet.

# XXX rerun these.

#+CONSTANTS: etho=38 ipo=20 espoh=34 ipso=54 tfso=58

#+BEGIN_CENTER

#+BEGIN_NOEXPORT
# We need the number of packets for adding in L2 overhead later.
# No need to export this to the published document
#+CAPTION: Required Outer Packets
#+TBLNAME:reqdpackets
|   Type | ESP+Pad | ESP+Pad | ESP+Pad |      IP-TFS |      IP-TFS |       IP-TFS |
| L3 MTU |     576 |    1500 |    9000 |         576 |        1500 |         9000 |
|  PSize |     522 |    1446 |    8946 |         518 |        1442 |         8942 |
|--------+---------+---------+---------+-------------+-------------+--------------|
|     40 |       1 |       1 |       1 | 0.077220077 | 0.027739251 | 4.4732722e-3 |
|    128 |       1 |       1 |       1 |  0.24710425 | 0.088765603 |  0.014314471 |
|    256 |       1 |       1 |       1 |  0.49420849 |  0.17753121 |  0.028628942 |
|    518 |       1 |       1 |       1 |           1 |  0.35922330 |  0.057928875 |
|    576 |       2 |       1 |       1 |   1.1119691 |  0.39944521 |  0.064415120 |
|   1442 |       3 |       1 |       1 |   2.7837838 |           1 |   0.16126146 |
|   1500 |       3 |       2 |       1 |   2.8957529 |   1.0402219 |   0.16774771 |
|   8942 |      18 |       7 |       1 |   17.262548 |   6.2011096 |            1 |
|   9000 |      18 |       7 |       2 |   17.374517 |   6.2413315 |    1.0064862 |
#+TBLFM: @3$2..@3$4=@2-$ipso;p40::@3$5..@3$7=@2-$tfso;p40::@4$2..@>$4=if($1<=@3, ceil($1/@3), 1 + ceil(($1-@3)/(@3-$ipo)));p40::@4$5..@>$7=$1/@3;p40
#+END_NOEXPORT

#+CAPTION: Overhead comparison in octets
#+TBLNAME:obytes
|   Type | ESP+Pad | ESP+Pad | ESP+Pad | IP-TFS | IP-TFS | IP-TFS |
| L3 MTU |     576 |    1500 |    9000 |    576 |   1500 |   9000 |
|  PSize |     522 |    1446 |    8946 |    518 |   1442 |   8942 |
|--------+---------+---------+---------+--------+--------+--------|
|     40 |     482 |    1406 |    8906 |    4.5 |    1.6 |    0.3 |
|    128 |     394 |    1318 |    8818 |   14.3 |    5.1 |    0.8 |
|    256 |     266 |    1190 |    8690 |   28.7 |   10.3 |    1.7 |
|    518 |       4 |     928 |    8428 |   58.0 |   20.8 |    3.4 |
|    576 |     576 |     870 |    8370 |   64.5 |   23.2 |    3.7 |
|   1442 |     286 |       4 |    7504 |  161.5 |   58.0 |    9.4 |
|   1500 |     228 |    1500 |    7446 |  168.0 |   60.3 |    9.7 |
|   8942 |    1426 |    1558 |       4 | 1001.2 |  359.7 |   58.0 |
|   9000 |    1368 |    1500 |    9000 | 1007.7 |  362.0 |   58.4 |
#+TBLFM: @3$2..@3$4=@2-$ipso::@3$5..@3$7=@2-$tfso::@4$2..@>$4=if(@3 > $1, @3-$1, ceil(($1-$ipo)/(@3-$ipo)) * ($ipso + @3) - $1::@4$5..@>$7=$tfso/(@3/$1);%.1f

#+CAPTION: Overhead as Percentage of Inner Packet Size
#+TBLNAME:avail-pct
|  Type | ESP+Pad | ESP+Pad |  ESP+Pad | IP-TFS | IP-TFS | IP-TFS |
|   MTU |     576 |    1500 |     9000 |    576 |   1500 |   9000 |
| PSize |     522 |    1446 |     8946 |    518 |   1442 |   8942 |
|-------+---------+---------+----------+--------+--------+--------|
|    40 | 1205.0% | 3515.0% | 22265.0% | 11.20% |  4.02% |  0.65% |
|   128 |  307.8% | 1029.7% |  6889.1% | 11.20% |  4.02% |  0.65% |
|   256 |  103.9% |  464.8% |  3394.5% | 11.20% |  4.02% |  0.65% |
|   518 |    0.8% |  179.2% |  1627.0% | 11.20% |  4.02% |  0.65% |
|   576 |  100.0% |  151.0% |  1453.1% | 11.20% |  4.02% |  0.65% |
|  1442 |   19.8% |    0.3% |   520.4% | 11.20% |  4.02% |  0.65% |
|  1500 |   15.2% |  100.0% |   496.4% | 11.20% |  4.02% |  0.65% |
|  8942 |   15.9% |   17.4% |     0.0% | 11.20% |  4.02% |  0.65% |
|  9000 |   15.2% |   16.7% |   100.0% | 11.20% |  4.02% |  0.65% |
#+TBLFM: @3$2..@3$4=@2-$ipso::@3$5..@3$7=@2-$tfso::$1=remote(obytes,@@#$1)::@4$2..@>$4=100*remote(obytes,@@#$$#)/$1;%.1f%%::@4$5..@>$7=100*$tfso/(@3/$1)/$1;%.2f%%
#+END_CENTER

*** Ethernet

In order to calculate the available bandwidth the per packet overhead
is calculated first. The total overhead of Ethernet is 14+4 octets of
header and CRC plus and additional 20 octets of framing (preamble,
start, and inter-packet gap) for a total of 38 octets. Additionally
the minimum payload is 46 octets.

# *** IP-TFS Bandwidth
# *** ESP with Padding Bandwidth

#+BEGIN_CENTER
#+BEGIN_NOEXPORT

#+TBLNAME: reqdbytes
| Size |   E+P |   E+P |   E+P |     IPTFS |     IPTFS |     IPTFS | Enet |  ESP |
|  MTU |   590 |  1514 |  9014 |       590 |      1514 |      9014 |  any |  any |
|   OH |    92 |    92 |    92 |        96 |        96 |        96 |   38 |   74 |
|------+-------+-------+-------+-----------+-----------+-----------+------+------|
|   40 |   614 |  1538 |  9038 | 47.413127 | 42.662968 | 40.429434 |   84 |  114 |
|  128 |   614 |  1538 |  9038 | 151.72201 | 136.52150 | 129.37419 |  166 |  202 |
|  256 |   614 |  1538 |  9038 | 303.44401 | 273.04300 | 258.74838 |  294 |  330 |
|  518 |   614 |  1538 |  9038 |       614 | 552.48544 | 523.56117 |  556 |  592 |
|  576 |  1228 |  1538 |  9038 | 682.74903 | 614.34673 | 582.18385 |  614 |  650 |
| 1442 |  1842 |  1538 |  9038 | 1709.2433 |      1538 | 1457.4811 | 1480 | 1516 |
| 1500 |  1842 |  3076 |  9038 | 1777.9923 | 1599.8613 | 1516.1038 | 1538 | 1574 |
| 8942 | 11052 | 10766 |  9038 | 10599.204 | 9537.3066 |      9038 | 8980 | 9016 |
| 9000 | 11052 | 10766 | 18076 | 10667.953 | 9599.1678 | 9096.6223 | 9038 | 9074 |
#+TBLFM: @2$2..@2$7=remote(obytes,@2$$#)+14::@3$2..@3$4=$etho + $ipso::@3$5..@3$7=$etho + $tfso::@4$2..@>$7=remote(reqdpackets,@@#$$#)*(@2+24);p40::@4$8..@>$>=max(84,$1+@I-1);p40
#+END_NOEXPORT

#+CAPTION: L2 Octets Per Packet
| Size | E + P | E + P | E + P | IPTFS | IPTFS | IPTFS | Enet |  ESP |
|  MTU |   590 |  1514 |  9014 |   590 |  1514 |  9014 |  any |  any |
|   OH |    92 |    92 |    92 |    96 |    96 |    96 |   38 |   74 |
|------+-------+-------+-------+-------+-------+-------+------+------|
|   40 |   614 |  1538 |  9038 |    47 |    42 |    40 |   84 |  114 |
|  128 |   614 |  1538 |  9038 |   151 |   136 |   129 |  166 |  202 |
|  256 |   614 |  1538 |  9038 |   303 |   273 |   258 |  294 |  330 |
|  518 |   614 |  1538 |  9038 |   614 |   552 |   523 |  574 |  610 |
|  576 |  1228 |  1538 |  9038 |   682 |   614 |   582 |  614 |  650 |
| 1442 |  1842 |  1538 |  9038 |  1709 |  1538 |  1457 | 1498 | 1534 |
| 1500 |  1842 |  3076 |  9038 |  1777 |  1599 |  1516 | 1538 | 1574 |
| 8942 | 11052 | 10766 |  9038 | 10599 |  9537 |  9038 | 8998 | 9034 |
| 9000 | 11052 | 10766 | 18076 | 10667 |  9599 |  9096 | 9038 | 9074 |
#+TBLFM: $1=remote(reqdbytes,$1)::@1$2..@3$>=remote(reqdbytes,@@#$$#)::@4$2..@>$4=remote(reqdbytes,@@#$$#)::@4$5..@>$7=remote(reqdbytes,@@#$$#);%d

#+BEGIN_NOEXPORT
#+TBLNAME: pps
| Size |     E + P |     E + P |     E + P |     IPTFS |     IPTFS |     IPTFS |      Enet |       ESP |
|  MTU |       590 |      1514 |      9014 |       590 |      1514 |      9014 |       any |       any |
|   OH |        92 |        92 |        92 |        96 |        96 |        96 |        38 |        74 |
|------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------|
|   40 | 2035830.6 | 812743.82 | 138304.93 | 26364007. | 29299415. | 30918068. | 14880952. | 10964912. |
|  128 | 2035830.6 | 812743.82 | 138304.93 | 8238751.9 | 9156067.0 | 9661896.2 | 7530120.5 | 6188118.8 |
|  256 | 2035830.6 | 812743.82 | 138304.93 | 4119376.1 | 4578033.5 | 4830948.1 | 4251700.7 | 3787878.8 |
|  518 | 2035830.6 | 812743.82 | 138304.93 | 2035830.6 | 2262503.1 | 2387495.6 | 2248201.4 | 2111486.5 |
|  576 | 1017915.3 | 812743.82 | 138304.93 | 1830833.8 | 2034681.6 | 2147088.1 | 2035830.6 | 1923076.9 |
| 1442 | 678610.21 | 812743.82 | 138304.93 | 731317.77 | 812743.82 | 857644.05 | 844594.59 | 824538.26 |
| 1500 | 678610.21 | 406371.91 | 138304.93 | 703040.17 | 781317.73 | 824481.81 | 812743.82 | 794155.02 |
| 8942 | 113101.70 | 116106.26 | 138304.93 | 117933.38 | 131064.26 | 138304.93 | 139198.22 | 138642.41 |
| 9000 | 113101.70 | 116106.26 | 69152.467 | 117173.37 | 130219.62 | 137413.64 | 138304.93 | 137756.23 |
#+TBLFM: @1$1..@>$1=remote(reqdbytes,@@#$$#)::@1$2..@3$>=remote(reqdbytes,@@#$$#)::@4$2..@>$>=(1e10/8)/remote(reqdbytes,@@#$$#)
#+END_NOEXPORT

# $8 = (1e10/8)/(max(46,$1)+38)
# $9 = (1e10/8)/($1+74)

#+CAPTION: Packets Per Second on 10G Ethernet
| Size | E + P | E + P | E + P | IPTFS | IPTFS | IPTFS | Enet  | ESP   |
|  MTU | 590   | 1514  | 9014  | 590   | 1514  | 9014  | any   | any   |
|   OH | 92    | 92    | 92    | 96    | 96    | 96    | 38    | 74    |
|------+-------+-------+-------+-------+-------+-------+-------+-------|
|   40 | 2.0M  | 0.8M  | 0.1M  | 26.4M | 29.3M | 30.9M | 14.9M | 11.0M |
|  128 | 2.0M  | 0.8M  | 0.1M  | 8.2M  | 9.2M  | 9.7M  | 7.5M  | 6.2M  |
|  256 | 2.0M  | 0.8M  | 0.1M  | 4.1M  | 4.6M  | 4.8M  | 4.3M  | 3.8M  |
|  518 | 2.0M  | 0.8M  | 0.1M  | 2.0M  | 2.3M  | 2.4M  | 2.2M  | 2.1M  |
|  576 | 1.0M  | 0.8M  | 0.1M  | 1.8M  | 2.0M  | 2.1M  | 2.0M  | 1.9M  |
| 1442 | 678K  | 812K  | 138K  | 731K  | 812K  | 857K  | 844K  | 824K  |
| 1500 | 678K  | 406K  | 138K  | 703K  | 781K  | 824K  | 812K  | 794K  |
| 8942 | 113K  | 116K  | 138K  | 117K  | 131K  | 138K  | 139K  | 138K  |
| 9000 | 113K  | 116K  | 69K   | 117K  | 130K  | 137K  | 138K  | 137K  |
#+TBLFM: $1=remote(pps,$1)::@1$2..@3$>=remote(pps,@@#$$#)::@4$2..@8$>=remote(pps,@@#$$#)/1000000;%.1fM::@9$2..@>$>=remote(pps,@@#$$#)/1000;%dK

#+CAPTION: Percentage of Bandwidth on 10G Ethernet
#+TBLNAME: bwpercent
| Size |  E + P |  E + P |  E + P |  IPTFS |  IPTFS |  IPTFS |   Enet |    ESP |
|      |    590 |   1514 |   9014 |    590 |   1514 |   9014 |    any |    any |
|      |     92 |     92 |     92 |     96 |     96 |     96 |     38 |     74 |
|------+--------+--------+--------+--------+--------+--------+--------+--------|
|   40 |  6.51% |  2.60% |  0.44% | 84.36% | 93.76% | 98.94% | 47.62% | 35.09% |
|  128 | 20.85% |  8.32% |  1.42% | 84.36% | 93.76% | 98.94% | 77.11% | 63.37% |
|  256 | 41.69% | 16.64% |  2.83% | 84.36% | 93.76% | 98.94% | 87.07% | 77.58% |
|  518 | 84.36% | 33.68% |  5.73% | 84.36% | 93.76% | 98.94% | 93.17% | 87.50% |
|  576 | 46.91% | 37.45% |  6.37% | 84.36% | 93.76% | 98.94% | 93.81% | 88.62% |
| 1442 | 78.28% | 93.76% | 15.95% | 84.36% | 93.76% | 98.94% | 97.43% | 95.12% |
| 1500 | 81.43% | 48.76% | 16.60% | 84.36% | 93.76% | 98.94% | 97.53% | 95.30% |
| 8942 | 80.91% | 83.06% | 98.94% | 84.36% | 93.76% | 98.94% | 99.58% | 99.18% |
| 9000 | 81.43% | 83.60% | 49.79% | 84.36% | 93.76% | 98.94% | 99.58% | 99.18% |
#+TBLFM: $1=remote(pps,$1)::@1$2..@3$>=remote(pps,@@#$$#)::@4$2..@>$9=(100*$1*remote(pps,@@#$$#))/(1e10/8);%.2f%%
#+END_CENTER

A sometimes unexpected result of using an AGGFRAG tunnel (or any packet
aggregating tunnel) is that, for small to medium sized packets, the
available bandwidth is actually greater than native Ethernet. This is
due to the reduction in Ethernet framing overhead. This increased
bandwidth is paid for with an increase in latency. This latency is
the time to send the unrelated octets in the outer tunnel frame. The
following table illustrates the latency for some common values on a
10G Ethernet link. The table also includes latency introduced by
padding if using ESP with padding.

#+BEGIN_CENTER
#+CAPTION: Added Latency
|      | ESP+Pad | ESP+Pad | IP-TFS  | IP-TFS  |
|      | 1500    | 9000    | 1500    | 9000    |
|      |         |         |         |         |
|------+---------+---------+---------+---------|
|   40 | 1.12 us | 7.12 us | 1.17 us | 7.17 us |
|  128 | 1.05 us | 7.05 us | 1.10 us | 7.10 us |
|  256 | 0.95 us | 6.95 us | 1.00 us | 7.00 us |
|  518 | 0.74 us | 6.74 us | 0.79 us | 6.79 us |
|  576 | 0.70 us | 6.70 us | 0.74 us | 6.74 us |
| 1442 | 0.00 us | 6.00 us | 0.05 us | 6.05 us |
| 1500 | 1.20 us | 5.96 us | 0.00 us | 6.00 us |
#+TBLFM: $2=(remote(obytes,@@#$3)*8)/10000;%.2f us::$3=(remote(obytes,@@#$4)*8)/10000;%.2f us::@4$4..@>$>=(((@2+4-$1)*8)/10000);%.2f us
#+END_CENTER

Notice that the latency values are very similar between the two
solutions; however, whereas IP-TFS provides for constant high
bandwidth, in some cases even exceeding native Ethernet, ESP with
padding often greatly reduces available bandwidth.

